In [1]:
import pandas as pd

data_location = '../data/officers.csv'
# data_location = 'https://github.com/elephantscale/datasets/blob/master/misc/officers.csv?raw=true'

df = pd.read_csv (data_location)
df

          ID           City State    Zip      Title  RedactionRequested
0        804       Glenview    IL  60025  Treasurer               False
1       9177     Harrisburg    IL  62946  Treasurer               False
2      53011        Chicago    IL  60606  Treasurer               False
3       9176     Harrisburg    IL  62946   Chairman               False
4      33020  Mechanicsburg    IL  62545   Chairman               False
...      ...            ...   ...    ...        ...                 ...
55209   3559       Hillside    IL  60162   Chairman               False
55210   3558       Hillside    IL  60162  Treasurer               False
55211  23177        Harvard    IL   6033   Chairman               False
55212  23712        Chicago    IL  60637  Treasurer               False
55213  10509           Peru    IL  61354  Treasurer               False

[55214 rows x 6 columns]

In [2]:
df['State'].unique()

array(['IL', 'PA', 'DC', 'Il', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA',
       'IN', 'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'il', 'WA', '8I',
       'In', 'iL', 'OH', 'SC', 'VA', 'NM', 'FL', 'LA', 'GA', 'II', 'NJ',
       'MD', 'I', 'AR', 'KS', 'DE', '60', 'SD', 'MN', 'VT', 'OK', 'KY',
       'CT', 'NH', 'AZ', 'OR', 'PR', 'RI'], dtype=object)

In [3]:
df['State'].value_counts()

IL    53642
Il      665
DC      254
MO      106
NY       48
IA       41
IN       41
PA       33
CA       32
WI       31
VA       22
TX       21
MA       18
MI       16
OH       16
MN       12
FL       11
GA       11
TN        8
MD        6
il        6
NC        6
CO        5
OR        3
WA        3
NM        3
KS        2
VT        2
CT        2
NH        2
AR        2
SC        2
NJ        2
NV        2
ng        2
RI        2
LA        2
II        2
DE        1
60        1
SD        1
iL        1
I         1
OK        1
KY        1
8I        1
AZ        1
PR        1
In        1
Name: State, dtype: int64

In [4]:
for state in ['Il', 'iL', 'Il']:
  print(df.loc[df['State'] == state, ['City', 'State']])

            City State
43        Ottawa    Il
44        Ottawa    Il
493    Galesburg    Il
613      Chicago    Il
614      Chicago    Il
...          ...   ...
54915    Chicago    Il
54916    Chicago    Il
54918    Chicago    Il
54919    Chicago    Il
54921    Chicago    Il

[665 rows x 2 columns]
         City State
7052  Wheaton    iL
            City State
43        Ottawa    Il
44        Ottawa    Il
493    Galesburg    Il
613      Chicago    Il
614      Chicago    Il
...          ...   ...
54915    Chicago    Il
54916    Chicago    Il
54918    Chicago    Il
54919    Chicago    Il
54921    Chicago    Il

[665 rows x 2 columns]

In [5]:
# flag / mask
il_mask = df['State'].isin(['il', 'Il', 'iL', 'Il'])
il_mask.sum()

672

In [6]:
df.loc[il_mask, 'State'] = 'IL'

In [7]:
df['State'].unique()

array(['IL', 'PA', 'DC', nan, 'WI', 'CA', 'MO', 'NC', 'IA', 'MA', 'IN',
       'MI', 'TN', 'NY', 'ng', 'TX', 'CO', 'NV', 'WA', '8I', 'In', 'OH',
       'SC', 'VA', 'NM', 'FL', 'LA', 'GA', 'II', 'NJ', 'MD', 'I', 'AR',
       'KS', 'DE', '60', 'SD', 'MN', 'VT', 'OK', 'KY', 'CT', 'NH', 'AZ',
       'OR', 'PR', 'RI'], dtype=object)

In [8]:
df['State'].value_counts()

IL    54314
DC      254
MO      106
NY       48
IA       41
IN       41
PA       33
CA       32
WI       31
VA       22
TX       21
MA       18
MI       16
OH       16
MN       12
GA       11
FL       11
TN        8
NC        6
MD        6
CO        5
OR        3
NM        3
WA        3
SC        2
KS        2
ng        2
NH        2
CT        2
VT        2
NV        2
RI        2
AR        2
NJ        2
II        2
LA        2
DE        1
In        1
SD        1
I         1
OK        1
KY        1
8I        1
AZ        1
PR        1
60        1
Name: State, dtype: int64

## We are not done yet.

We still see states like **8I** and **60** !

In [9]:
df[df['State'] == '60']

         ID     City State  Zip      Title  RedactionRequested
28060  1513  Chicago    60  644  Treasurer               False

In [10]:
df[df['State'] == '8I']

        ID         City State    Zip      Title  RedactionRequested
5513  7771  Springfield    8I  62704  Treasurer               False

In [14]:
# fix it
df.loc[df['State'] == '60', 'State'] = 'IL'

In [ ]:
# verify - should be no more records
df[df['State'] == '60']

In [15]:
df['State'].value_counts()

IL    54315
DC      254
MO      106
NY       48
IN       41
IA       41
PA       33
CA       32
WI       31
VA       22
TX       21
MA       18
MI       16
OH       16
MN       12
GA       11
FL       11
TN        8
MD        6
NC        6
CO        5
OR        3
WA        3
NM        3
KS        2
VT        2
CT        2
NH        2
AR        2
II        2
NJ        2
LA        2
SC        2
NV        2
ng        2
RI        2
I         1
DE        1
SD        1
In        1
OK        1
KY        1
8I        1
AZ        1
PR        1
Name: State, dtype: int64